CSI API ETABS v1
cDStAISC360_10.GetPreference Method
 Retrieves the value of a steel design preference item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPreference(
	int Item,
	ref double Value
)
Function GetPreference (
	Item As Integer,
	ByRef Value As Double
) As Integer
Dim instance As cDStAISC360_10
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.GetPreference(Item,
	Value)
int GetPreference(
	int Item,
	double% Value
)
abstract GetPreference :
        Item : int *
        Value : float byref -> int
Parameters
Item
Type: System.Int32
 This is an integer between 2 and 54, inclusive, indicating the preference item considered.
Multi-Response Case Design
Framing Type
Seismic Design Category
Importance Factor I
Design System Rho
Design System Sds
Design System R
Design System Omega0
Design System Cd
Design Provision
Analysis Method
Second Order Method
Stiffness Reduction Method
Add notional load cases into seismic combos?
BRB Beta Factor
BRB BetaOmega Factor
Phi (Bending)
Phi (Compression)
Phi (Tension-Yielding)
Phi (Tension-Fracture)
Phi (Shear)
Phi (Shear-Short Webbed Rolled I)
Phi (Torsion)
Ignore Seismic Code?
Ignore Special Seismic Load?
Is Doubler Plate Plug-Welded?
HSS Welding Type
Reduce HSS Thickness?
Consider Deflection?
DL deflection limit, L/Value
SDL + LL deflection limit, L/Value
LL deflection limit, L/Value
Total load deflection limit, L/Value
Total load deflection minus camber limit, L/Value
Pattern Live Load Factor
Demand/Capacity Ratio Limit
Max Number of Auto Iterations
Omega (Bending)
Omega (Compression)
Omega (Tension-Yielding)
Omega (Tension-Fracture)
Omega (Shear)
Omega (Shear-Short Webbed Rolled I)
Omega (Torsion)
Value
Type: System.Double
 The value of the considered preference item.
 Multi-Response Case Design
1 = Envelopes
2 = Step-by-step
3 = Last step
4 = Envelopes -- All
5 = Step-by-step -- All
 Framing Type
1 = SMF
2 = IMF
3 = OMF
4 = SCBF
5 = OCBF
6 = OCBFI
7 = EBF
8 = BRBF
 Seismic Design Category
1 = A
2 = B
3 = C
4 = D
5 = E
6 = F
 Importance Factor I
Value > 0
 Design System Rho
Value > 0
 Design System Sds
Value > 0
 Design System R
Value > 0
 Design System Omega0
Value > 0
 Design System Cd
Value > 0
 Design provision
1 = LRFD
2 = ASD
 Analysis Method
1 = Direct Analysis
2 = Effective Length
3 = Limited 1st Order
 Second Order Method
1 = General 2nd Order
2 = Amplified 1st Order
 Stiffness Reduction Method
1 = Tau-b variable
2 = Tau-b Fixed
3 = No Modification
 Add notional load cases into seismic combos?
0 = No
Any other value = Yes
 BRB Beta Factor
Value > 0
 BRB BetaOmega Factor
Value > 0
 Phi (Bending)
Value > 0
 Phi (Compression)
Value > 0
 Phi (Tension-Yielding)
Value > 0
 Phi (Tension-Fracture)
Value > 0
 Phi (Shear)
Value > 0
 Phi (Shear-Short Webbed Rolled I)
Value > 0
 Phi (Torsion)
Value > 0
 Ignore Seismic Code?
0 = No
Any other value = Yes
 Ignore Special Seismic Load?
0 = No
Any other value = Yes
 Is Doubler Plate Plug-Welded?
0 = No
Any other value = Yes
 HSS Welding Type
1 = ERW
2 = SAW
 Reduce HSS Thickness?
0 = No
Any other value = Yes
 Consider Deflection?
0 = No
Any other value = Yes
 DL deflection limit, L/Value
Value > 0
 SDL + LL deflection limit, L/Value
Value > 0
 LL deflection limit, L/Value
Value > 0
 Total load deflection limit, L/Value
Value > 0
 Total load deflection minus camber limit, L/Value
Value > 0
 Pattern Live Load Factor
Value > 0
 Demand/Capacity Ratio Limit
Value > 0
 Max Number of Auto Iterations
Value > 0
 Omega (Bending)
Value > 0
 Omega (Compression)
Value > 0
 Omega (Tension-Yielding)
Value > 0
 Omega (Tension-Fracture)
Value > 0
 Omega (Shear)
Value > 0
 Omega (Shear-Short Webbed Rolled I)
Value > 0
 Omega (Torsion)
Value > 0
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignSteel.SetCode("AISC 360-10")
'get preference item
   ret = SapModel.DesignSteel.AISC360_10.GetPreference(4, Value)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDStAISC360_10 Interface
ETABSv1 Namespace